(*‡ ¯¨á¨ â¥«¥ä®­­ëå ­®¬¥à®¢ ®¡ëç­® á®¤¥à¦ â ¤®¯®«­¨â¥«ì­ë¥ á¨¬¢®«ë: 
áª®¡ª¨, ç¥àâ®çª¨, ¯à®¡¥«ë, ­ ¯à¨¬¥à: 8(123)45-67-89. à¥¤¯®«®¦¨¬, çâ®
¯®«ì§®¢ â¥«ì ¨å â ª ¨ ¢¢®¤¨â. ãáâì ¢ è  ¯à®£à ¬¬  ã¤ «¨â ¨§ â ª®© áâà®ª¨ ¢á¥
á¨¬¢®«ë, ªà®¬¥ æ¨äà.  ¯à¨¬¥à, ¯®á«¥ ¢¢®¤  ãª § ­­®£® ¢ëè¥ ­®¬¥à  ®­ 
¤®«¦­  ­ ¯¥ç â âì: 8123456789.*)
var
inp, out : string;
len, i, j : integer;

begin
	Write('‚¢¥¤¨â¥ áâà®ªã: ');
	Readln(inp);

	j := 0;
	len := Length(inp);
	out := '';

	for i:=1 to len do
		if (inp[i] >= '0') and (inp[i] <= '9') then begin
			out := out + inp[i];
			j := j + 1;
		end;

		// case inp[i] of
		// 	'0'..'9': begin
		// 				out := out + inp[i];
		// 				j := j + 1;
		// 			  end;
		// end;

	Writeln(out);
end.
